const test = {
    "Космонавтика": {
        questions: [
            "В каком году был запущен первый искусственный спутник Земли?",
            "Кто стал первым человеком, совершившим полет в открытый космос?",
            "Какой корабль доставил первый модуль на Луну в рамках программы Apollo?",
            "Как называется первый космический аппарат, полетевший к Марсу?",
            "Что такое МКС в контексте космонавтики?",
            "Какой спутник Солнечной системы является самым крупным?",
            "Кто был вторым человеком, зашедшим на Луну?",
            "Как называется первая станция, постоянно находящаяся в орбите Земли?",
            "Как называется модуль лунного ландшафта, в котором приземлились совершившие высадку астронавты?",
            "Кто была первой женщиной-космонавтом?"
        ],
        answers: [
            "1957 год",
            "Юрий Гагарин",
            "Луноход Apollo 11",
            "Маринер 4",
            "Международная космическая станция",
            "Ганимед",
            "Базз Олдрин",
            "МКС (Международная космическая станция)",
            "Луноход",
            "Валентина Терешкова"
        ]
    },
    "Информатика": {
        questions: [
            "Кто является основателем научной дисциплины информатика?",
            "Какая компьютерная линейка является одной из самых распространенных и популярных в мире?",
            "Что такое алгоритм в контексте информатики?",
            "Какой язык программирования считается одним из самых популярных и широко используемых в мире?",
            "Что представляет собой термин 'база данных' в информатике?",
            "Каково значение термина 'бит' в информатике?",
            "Как называется технология, позволяющая передавать данные через провода или беспроводные среды?",
            "Какие компоненты обычно входят в состав центрального процессора (ЦП) компьютера?",
            "Что такое виртуальная реальность в контексте информатики?",
            "Кто является создателем самого популярного протокола передачи данных в Интернете?"
        ],
        answers: [
            "Алан Тьюринг",
            "Apple Macintosh",
            "Последовательность шагов или инструкций для выполнения определенной задачи компьютере",
            "Python",
            "Организованная коллекция данных, обычно хранящаяся и доступная для многих пользователей",
            "Однобитное цифровое значение, основной единицей измерения информации в компьютерной науке",
            "Сеть",
            "Арифметико-логическое устройство (ALU), устройство управления, регистры",
            "Имитация среды, создаваемая программным обеспечением и воспринимаемая пользователем как настоящая",
            "Тим Бернерс-Ли"
        ]
    },
    "Программирование на JS": {
        questions: [
            "Что означает аббревиатура JS в контексте программирования?",
            "Какие основные типы данных существуют в JavaScript?",
            "Что такое функция обратного вызова (callback) в JavaScript?",
            "Каким образом можно осуществить циклическое выполнение кода в JavaScript?",
            "Что такое замыкание (closure) в JavaScript?",
            "Какие основные принципы объектно-ориентированного программирования реализованы в JavaScript?",
            "Как осуществить асинхронный запрос к серверу с помощью JavaScript?",
            "Что такое стрелочные функции (arrow functions) в JavaScript?",
            "Что такое методы массивов и какие основные методы предоставляет JavaScript для работы с массивами?",
            "Каким образом можно объявить переменную в JavaScript?"
        ],
        answers: [
            "JavaScript",
            "Числовой, строковый, булев, объект, функция, неопределенный, null",
            "Функция, передаваемая в качестве аргумента в другую функцию для выполнения после завершения определенной задачи",
            "С использованием циклов for, while или do-while",
            "Функция, которая имеет доступ к своему собственному замыканию, включая переменные из внешней области видимости",
            "Инкапсуляция, наследование, полиморфизм",
            "С помощью объекта XMLHttpRequest или современных методов, таких как fetch API",
            "Краткий и более читабельный синтаксис для объявления функций в JavaScript",
            "Методы массивов позволяют выполнять различные операции с массивами, такие как добавление, удаление, фильтрация и преобразование элементов",
            "С помощью ключевых слов var, let или const"
        ]
    },
    "Млекопитающие": {
        questions: [
            "Что отличает млекопитающих от других классов животных?",
            "Какие основные группы млекопитающих выделяются с точки зрения питания?",
            "Что представляют собой живородящие млекопитающие?",
            "Какие являются основные адаптации млекопитающих к окружающей среде?",
            "Какие виды млекопитающих являются хищниками?",
            "Каковы представители млекопитающих, обитающих в водной среде?",
            "Какие млекопитающие являются носителями ядовитых укусов или жалов?",
            "Какие экосистемные роли играют млекопитающие в природе?",
            "Какие млекопитающие являются хищниками?",
            "Какие млекопитающие являются носителями ядовитых укусов или жалов?"
        ],
        answers: [
            "Наличие молочных желез у самок для кормления детенышей, наличие волос и теплокровность",
            "Травоядные, хищные, всеядные",
            "Млекопитающие, у которых молодые развиваются внутри матки матери и рождаются живыми",
            "Развитие высокой теплокровности, способность к уходу за потомством, разнообразие методов передвижения и поиска пищи",
            "Львы, тигры, волки, шакалы",
            "Киты, дельфины, тюлени, моржи",
            "Змеи, скорпионы, опоссумы",
            "Участие в цепях питания, помощь в распространении семян, контроль популяции добычи",
            "Львы, тигры, волки, шакалы",
            "Змеи, скорпионы, опоссумы"
        ]
    },
    "Музыка": {
        questions: [
            "Какие основные элементы входят в музыкальную композицию?",
            "Что представляет собой нотная грамота в музыкальной теории?",
            "Какие жанры музыки популярны в современном мире?",
            "Что такое темп в музыке?",
            "Какие основные музыкальные инструменты существуют?",
            "Кто является изобретателем фортепиано?",
            "Что такое вокальный диапазон?",
            "Какие музыкальные термины характеризуют громкость и тишину в музыке?",
            "Какие музыкальные термины характеризуют скорость воспроизведения музыки?",
            "Что такое музыкальная импровизация?"
        ],
        answers: [
            "Мелодия, ритм, гармония, тембр",
            "Система символов, используемых для записи музыкальных звуков",
            "Поп, рок, рэп, джаз, классика, электронная музыка и др.",
            "Скорость музыкальной композиции",
            "Струнные, духовые, клавишные, ударные, электронные",
            "Бартоломео Кристиофори",
            "Диапазон нот, доступных для исполнения вокалистом или инструменталистом",
            "Фортиссимо (ff) - очень громко, пианиссимо (pp) - очень тихо",
            "Темп, аллегро, адажио, анданте",
            "Импровизация - создание музыки на ходу, без заранее спланированных нот или мелодий"
        ]
    },
    "Кино": {
        questions: [
            "Какие основные жанры кино существуют?",
            "Каковы основные этапы производства кино?",
            "Что такое сценарий кинофильма?",
            "Какие факторы влияют на кассовые сборы кинофильма?",
            "Кто считается изобретателем кинематографа?",
            "Какие технические новшества вносят изменения в киноиндустрию?",
            "Какие фестивали кино являются самыми престижными в мире?",
            "Каковы основные элементы кинематографической постановки?",
            "Кто такие режиссер и продюсер в киноиндустрии?",
            "Что такое монтаж в кино?"
        ],
        answers: [
            "Драма, комедия, эпическое кино, ужасы, фантастика, боевик, мелодрама и другие",
            "Разработка сценария, съемки, монтаж, постпродакшн",
            "Текст, содержащий описание действия и диалогов персонажей кинофильма",
            "Актерский состав, сюжет, режиссура, рекламная кампания и другие",
            "Луи Люмьер и Огюст Люмьер",
            "Виртуальная и дополненная реальность, технологии 3D и 4D, HDR и другие",
            "Каннский кинофестиваль, фестиваль в Карловых Варах, Берлинский международный кинофестиваль и другие",
            "Кадрирование, свет, звук, монтаж, декорации, костюмы и другие",
            "Режиссер - ответственен за визуальное и драматургическое исполнение фильма; Продюсер - обеспечивает финансовую и организационную сторону производства кинофильма",
            "Создание последовательности из различных кадров для формирования цельной кинематографической работы"
        ]
    },
    "Автомобили": {
        questions: [
            "Какие основные типы автомобильных двигателей существуют?",
            "Что такое уровень лошадиных сил в автомобиле?",
            "Какие основные виды трансмиссий используются в автомобилях?",
            "Что представляют собой системы безопасности в автомобиле?",
            "Какие технические характеристики влияют на экономичность расхода топлива в автомобиле?",
            "Какие факторы влияют на выбор автомобильных шин?",
            "Что такое гибридный автомобиль и каковы его преимущества?",
            "Какие технологические инновации вносят изменения в автомобильную промышленность?",
            "Что такое система ABS в автомобиле?",
            "Какие факторы влияют на выбор масла для автомобильного двигателя?"
        ],
        answers: [
            "Бензиновый, дизельный, гибридный, электрический",
            "Мера мощности двигателя",
            "Механическая, автоматическая, вариатор, роботизированная",
            "Подушки безопасности, система ABS, контроль стабильности, крепление детского кресла и другие",
            "Вес автомобиля, аэродинамические характеристики, тип двигателя, состояние дороги и другие",
            "Сезон, тип дорожного покрытия, стиль вождения, экологические характеристики, размеры и другие",
            "Автомобиль, использующий как двигатель внутреннего сгорания, так и электродвигатель; Преимущества включают экономию топлива и снижение выбросов",
            "Электрические и гибридные технологии, автопилоты, связанность с мобильными устройствами, экологически чистые материалы",
            "Система антиблокировки тормозов, предотвращающая блокировку колес при торможении",
            "Тип двигателя, климатические условия, стиль вождения, производственные рекомендации и другие"
        ]
    }
};

export default test;

